#include <iostream>
#include <string>
using namespace std;
int main()
{
	int k;	//количество записей
	cin >> k;
	string *arr = new string[k];	//создаем динамический массив строк
	for (int i = 0;i < k;i++)	// в цикле вводим заданные записи
	{
		cin >> arr[i];
	}
	for (int i = 0;i < k;i++)	//в цикле проверяем на правильность ввода записей
	{
		string S;	//создаем строковую переменную
		S = arr[i];	//каждую итерацию присваевыем новую запись	
		//множественная проверка через if для повышения скорости выполнения задачи
		if ((S[0] == 'A' || S[0] == 'B' || S[0] == 'C' || S[0] == 'E' ||	//проверяем перввый элемент на подходящие значения
			S[0] == 'H' || S[0] == 'K' || S[0] == 'M' || S[0] == 'O' ||
			S[0] == 'P' || S[0] == 'T' || S[0] == 'X' || S[0] == 'Y')
			&& (S[1] >= 48 && S[1] <= 57 && S[2] >= 48 &&		//проверяем 2-4 элементы используя строковы код чисел 0-9
				S[2] <= 57 && S[3] >= 48 && S[3] <= 57)
			&& (S[4] == 'A' || S[4] == 'B' || S[4] == 'C' || S[4] == 'E' ||	//также проверяем 5-6 элементы на подходящие значения
				S[4] == 'H' || S[4] == 'K' || S[4] == 'M' || S[4] == 'O' ||
				S[4] == 'P' || S[4] == 'T' || S[4] == 'X' || S[4] == 'Y')
			&& (S[5] == 'A' || S[5] == 'B' || S[5] == 'C' || S[5] == 'E' ||
				S[5] == 'H' || S[5] == 'K' || S[5] == 'M' || S[5] == 'O' ||
				S[5] == 'P' || S[5] == 'T' || S[5] == 'X' || S[5] == 'Y')
			&& S.length()<7 && S.length()>5)	//также проверка на количество элементов в строке
			cout << "Yes" << endl;	//если все условия соблюдены выводим Yes
		else
			cout << "No" << endl;	//иначе No
	}
	system("pause");
}